day1/video_games/app/controllers/tournaments_api_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
 def index
    tournaments_array = Tournament.all

INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "playing hookie"], ["created_at", "2016-07-20 13:44:49.967706"], ["updated_at", "2016-07-20 13:44:49.967706"]]
---
  def create
  	the_tournament = Tournament.create(tournament_params)